// Utilities
import { defineStore } from "pinia";

export const useAppStore = defineStore("app", {
  state: () => ({
    burgers: [
      {
        id: 1,
        name: "Классический Бургер",
        ingridients: [
          "говяжья котлета",
          "свежий салат",
          "помидоры",
          "лук",
          "маринованные огурцы",
          "сыр Чеддер",
          "соус BBQ",
          "булочка",
        ],
        price: 650,
        grams: 350,
      },
      {
        id: 2,
        name: "Бургер с курицей-гриль",
        ingridients: [
          "куриная котлета",
          "свежий салат",
          "помидоры",
          "авокадо",
          "соус Цезарь",
          "булочка",
        ],
        price: 700,
        grams: 350,
      },
      {
        id: 3,
        name: "Мексиканский Бургер",
        ingridients: [
          "говяжья котлета",
          "перец Халапеньо",
          "гуакамоле",
          "сыр Фета",
          "булочка",
        ],
        price: 750,
        grams: 350,
      },
      {
        id: 4,
        name: "Чили Бургер",
        ingridients: [
          "острая говяжья котлета",
          "халапеньо",
          "помидоры",
          "лук",
          "сыр Чеддер",
          "булочка",
        ],
        price: 800,
        grams: 400,
      },
      {
        id: 5,
        name: "Бургер с брусничным соусом",
        ingridients: [
          "говяжья котлета",
          "рукола",
          "лук",
          "сыр Чеддер",
          "брусничный соус",
          "булочка",
        ],
        price: 850,
        grams: 450,
      },
      {
        id: 6,
        name: "Толстяк Бондарь",
        ingridients: [
          "двойная говяжья котлета",
          "рукола",
          "помидоры",
          "лук",
          "маринованные огурцы",
          "сыр Чеддер",
          "сыр Камамбер",
          "соус Бондарь",
          "булочка",
        ],
        price: 950,
        grams: 600,
      },
    ],
    steaks: [
      {
        id: 1,
        name: "Стейк Савиных",
        ingridients: [
          "рибай стейк",
          "соль",
          "перец",
          "чеснок",
          "оливковое масло",
          "картофельное пюре",
        ],
        price: 1200,
        grams: 400,
      },
      {
        id: 2,
        name: "Стейк Штягина",
        ingridients: [
          "стейк Нью-Йорк",
          "соус ред вултипе",
          "гарнир из овощей гриль",
        ],
        price: 1300,
        grams: 400,
      },
      {
        id: 3,
        name: "Стейк Бондаря",
        ingridients: [
          "филе миньон",
          "сушеные травы",
          "соус Бондаря",
          "картофель фри",
        ],
        price: 1500,
        grams: 500,
      },
    ],
    ribs: [
      {
        id: 1,
        name: "Рёбрышки Badger BBQ",
        ingridients: [
          "ребрышки свиные",
          "специальный соус BBQ",
          "картофель фри",
        ],
        price: 900,
        grams: 450,
      },
      {
        id: 2,
        name: "Рёбрышки Пархоменко",
        ingridients: [
          "ребрышки говяжьи",
          "спайси соус",
          "гарнир из запечённых овощей",
        ],
        price: 1000,
        grams: 450,
      },
    ],
    salats: [
      {
        id: 1,
        name: "Салат Цезарь",
        price: 550,
        grams: 320,
      },
      {
        id: 2,
        name: "Греческий салат",
        price: 500,
        grams: 450,
      },
      {
        id: 3,
        name: "Салат Салават",
        price: 600,
        grams: 450,
      },
      {
        id: 4,
        name: "Салат Akellah",
        price: 1000,
        grams: 400,
      },
    ],
    drinks: {
      nonAlcohol: [
        {
          id: 1,
          name: "Минеральная вода",
          price: 200,
          grams: 500,
        },
        {
          id: 2,
          name: "Ассортимент соков",
          price: 250,
          grams: 500,
        },
        {
          id: 3,
          name: "Кока-Кола / Спрайт",
          price: 250,
          grams: 500,
        },
        {
          id: 4,
          name: "Лимонад домашний",
          price: 300,
          grams: 500,
        },
      ],
      alcohol: [
        {
          id: 1,
          name: "Пиво разливное",
          price: 350,
          grams: 500,
        },
        {
          id: 2,
          name: "Красное/белое вино",
          price: 500,
          grams: 350,
        },
        {
          id: 3,
          name: "Коктейли",
          price: 500,
          grams: 400,
        },
      ],
    },
  }),
});
